app/views/users/show.html.erb

    <h1>Welcome, <%= current_user.username %></h1>
    <p>You currently have <%= current_user.songs.count %> songs in your collection. </p>
---
SELECT "songs".* FROM "songs" INNER JOIN "user_songs" ON "songs"."id" = "user_songs"."song_id" WHERE "user_songs"."user_id" = ? ORDER BY "songs"."id" DESC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "songs" INNER JOIN "user_songs" ON "songs"."id" = "user_songs"."song_id" WHERE "user_songs"."user_id" = ?  [["user_id", 1]]

    <p><%= @user.username %>'s Profile Page %> </p>
    <p><%= @user.username %> owns <%= @user.songs.count %> songs.</p>
---
SELECT "songs".* FROM "songs" WHERE "songs"."name" = ? LIMIT ?  [["name", " 1901"], ["LIMIT", 1]]