app/views/songs/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "user_songs" WHERE "user_songs"."user_id" = ? AND "user_songs"."song_id" = ? LIMIT ?  [["user_id", 1], ["song_id", 1], ["LIMIT", 1]]
---
                <% if current_user %>
                    <% if !current_user.user_songs.where(song_id: song.id).exists? %>