app/controllers/songs_controller.rb

SELECT "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 138], ["LIMIT", 1]]
SELECT "songs".* FROM "songs" ORDER BY "songs"."name" ASC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT 1 AS one FROM "songs" ORDER BY "songs"."name" ASC LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 25], ["OFFSET", 0]]
---
    def index
        if params[:artist_id]
            @artist = Artist.find_by(id: params[:artist_id])
            if @artist.nil?
                redirect_to artists_path, flash[:alert] = "Artist not found"
            else
                @songs = @artist.songs
            end
        else
            @songs = Song.order('LOWER(name)').page(params[:page])

SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "user_songs" WHERE "user_songs"."user_id" = ? AND "user_songs"."song_id" = ? LIMIT ?  [["user_id", 1], ["song_id", 1], ["LIMIT", 1]]
---
    def show
        @song = Song.friendly.find(params[:id])
        # @song = Song.friendly.find(params[:slug ])
        if current_user.songs.exists?(@song.id)