app/controllers/user_songs_controller.rb

INSERT INTO "user_songs" ("user_id", "song_id") VALUES (?, ?)  [["user_id", 1], ["song_id", 3]]
---
    def create
        user_song = UserSong.create(user_song_params)

SELECT "user_songs".* FROM "user_songs" WHERE "user_songs"."user_id" = ? AND "user_songs"."song_id" = ? LIMIT ?  [["user_id", 1], ["song_id", 3], ["LIMIT", 1]]
DELETE FROM "user_songs" WHERE "user_songs"."id" = ?  [["id", 2]]
SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def destroy
        user_song = UserSong.find_by(user_song_params)
        if current_user.id == user_song.user_id
        # binding.pry
            user_song.delete
            redirect_to songs_path, flash: { message: "Deleted #{Song.find(user_song.song_id).full_title} from collection"}