app/models/user.rb

SELECT "user_songs".* FROM "user_songs" WHERE "user_songs"."user_id" = ? ORDER BY "user_songs"."id" DESC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
    def last_song_added
        Song.find(self.user_songs.last.song_id)